import numpy as np
def sum_2_rows( M ):
    return M[0::2,::]+M[1::2,::]
def sum_left_right( M ):
 # คนืผลทไี่ ดจ้ากการรวมจ านวนของครงึ่ ซา้ยกับครงึ่ ขวาของ M
 # เชน่ M = [[ 0, 1, 2, 3], ได ้ [[ 2, 4],
 # [ 4, 5, 6, 7], [10, 12],
 # [ 8, 9, 10, 11], [18, 20],
 # [12, 13, 14, 15]] [26, 28]]
    N = M.shape[1]//2
    return M[::,:N]+M[::,N:]
def sum_upper_lower( M ):
 # คืนผลที่ได ้จากการรวมจ านวนของครึ่งบนกับครึ่งล่างของ M
 # เชน่ M = [[ 0, 1, 2, 3], ได ้ [[ 8, 10, 12, 14],
 # [ 4, 5, 6, 7], [16, 18, 20, 22]]
 # [ 8, 9, 10, 11], 
 # [12, 13, 14, 15]] 
    N = M.shape[0]//2
    return M[:N,::]+M[N:,::]
def sum_4_quadrants( M ):
 # คืนผลที่ได ้จากการแบ่ง M เป็น 4 จตุภาค และรวมจ านวนที่ต าแหน่งตรงกันในแต่ละจตุภาค
 # เชน่ M = [[ 0, 1, 2, 3], ได ้ [[20, 24],
 # [ 4, 5, 6, 7], [36, 40]]
 # [ 8, 9, 10, 11], 
 # [12, 13, 14, 15]] 
    x = M.shape[0]//2
    y = M.shape[1]//2
    return M[0:x,0:y] + M[0:x,y:] + M[x:,0:y] + M[x:,y:]
def sum_4_cells( M ):
 # คืนผลที่ได ้จากการรวมจ านวนที่ติดกัน 4 ตัว ตามรูปแบบในตัวอย่างข ้างล่างนี้
 # เชน่ M = [[ 0, 1, 2, 3], ได ้ [[10, 18],
 # [ 4, 5, 6, 7], [42, 50]]
 # [ 8, 9, 10, 11], 
 # [12, 13, 14, 15]] 
    return M[0::2,0::2]+M[0::2,1::2]+M[1::2,0::2]+M[1::2,1::2]
def count_leap_years( years ):
 # years เป็นอาเรย์เก็บปี พ.ศ.
 # คืนจ านวนปีใน years ที่เป็นปีอทิกสุรทิน (ปีที่ ก.พ. มี 29 วัน)
    years-=543
    a = years%400==0
    b = years%4==0
    c = years%100!=0
    return sum(a|(b&c))
exec(input().strip()) # ตอ้ งมคี าสั่งนี้ ตรงนี้ตอนสง่ ให้Grader ตรวจ